while True:                             # Бесконечный цикл условие которого всегда (True), цикл можно и сделать по условию False
    print('Plase type your name.')
    name = input()                      # Вводим значение
    if name == 'vlad':                  # Условие прерывания -> Значение равно 'vlad' выполнить break, иначе повторить цикл
        break                           # Прервать цикл если условие истина
print('Thank you!')                     # Вывести сообщение при условии истина
